/* eslint-disable no-useless-escape */
const regex = {
    //网址
    url: /(((^https?:(?:\/\/)?)(?:[-;:&=\+\$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?|(?:www.|[-;:&=\+\$,\w]+@)[A-Za-z0-9.-]+)((?:\/[\+~%\/.\w-_]*)?\??(?:[-\+=&;%@.\w_]*)#?(?:[\w]*))?)$/,
    //邮箱
    email: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,5}$/,
    //手机号
    mobile: /^1[3456789]\d{9}$/,
    //身份证号
    idCard: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
    // 护照
    postCard: /(^[EeKkGgDdSsPpHh]\d{8}$)|(^(([Ee][a-fA-F])|([DdSsPp][Ee])|([Kk][Jj])|([Mm][Aa])|(1[45]))\d{7}$)/,
    // 军官证
    officerCard: /^[\u4E00-\u9FA5](字第)([0-9a-zA-Z]{4,8})(号?)$/,
    //社会统一信用代码
    socialUnCode: /^([0-9A-HJ-NPQRTUWXY]{2}\d{6}[0-9A-HJ-NPQRTUWXY]{10}|[1-9]\d{14})$/,
    //IP地址
    ipAddress: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/,
    //只能输入数字
    onlyNumber: /^[0-9]*$/,
    //不能输入中文
    noCn: /^[^\u4e00-\u9fa5]+$/,
    //不能包含空格
    noBlankSpace: /^\S*$/,
    // 只能输入中文
    mustChinese: /^[\u4e00-\u9fa5]+$/,
    //特殊字符
    spCode: /[(\ )(\~)(\!)(\@)(\#)(\$)(\%)(\^)(\&)(\*)(\()(\))(\-)(\+)(\=)(\[)(\])(\{)(\})(\|)(\\)(\;)(\:)(\')(\")(\,)(\.)(\/)(\<)(\>)(\?)(\)(\_)(·)(！)(￥)(……)(（)(）)(—)(【)(】)(、)(：)(；)(‘)(’)(“)(”)(，)(《)(。)(》)(？)]+/,
    //只能输入数字，中文，英文
    onlyNumberCnEn: /^[\a-\z\A-\Z0-9\u4E00-\u9FA5]+$/,
    // 只能输入正整数
    mustZNum: /^\+?[1-9][0-9]*$/,
    // 只能输入数字和*
    mustStarNum: /(^[0-9]{1,2}\*{1}[0-9]{1,2}$)/,
    // 只能输入中文和（）
    mustKHChinese: /^[\（\）\u4E00-\u9FA5]+$/,
    
}

//网址
export default regex;